---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FamilySeparationTestingError
source: html/0c906828-dfad-20d3-6085-e4eecaf61f07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FamilySeparationTestingError Property

Family separation testing error (internal).

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilySeparationTestingError { get; }
```